Gustice/LightController/Firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_ESP_WIFI_SSID="cLight"
CONFIG_ESP_WIFI_PASSWORD="FiatLux!"
CONFIG_ESP_MAX_STA_CONN=4


# Flash and Partition Options
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"


# Files
DEVICE_CONFIGURATION_FILENAME="DeviceId.json"